"%@ - Offline" = "%@ - Võrguühenduseta";

"3D Secure" = "3D Secure";

"Add New Card…" = "Lisa uus kaart ...";

"Add a Card" = "Kaardi lisamine";

"Apt." = "Korter";

"Contact" = "Kontakt";

"Delivery" = "Tarnimine";

"Delivery Address" = "Tarneaadress";

"Free" = "Tasuta";

"Invalid Shipping Address" = "Kehtetu tarneaadress";

"Loading…" = "Laadimine ...";

"Multibanco" = "Multibanco";

"Next" = "Järgmine";

"Online Banking (FPX)" = "Internetipank (FPX)";

"Payment Method" = "Makseviis";

"Shipping" = "Tarnimine";

"Shipping Method" = "Tarneviis";

"Use Billing" = "Kasuta arveldusaadressi";

"Use Delivery" = "Kasuta saaja aadressi";

"Use Shipping" = "Kasuta tarneaadressi";
